[
  {
    "id": 1,
    "snackno": "SNACK 1",
    "snacknameeng": "MAMEE Snack Noodles",
    "snacknamechi": "媽咪麵",
    "cantonesepronunciation": "maa1 mi4 min6",
    "origin": "Hong Kong",
    "img": "mameesnacknoodles.jpg",
    "description": "a crunchy noodle snack where you simply crush the noodles up before opening, add in the seasoning powder, and shake along till everything is mixed.",
    "netweight": "60g",
    "category": "Snack Noodles",
    "priceusd": "$2.83",
    "flavors": "Original",
    "brand": "Mamee",
    "personalrating": "★★★★★",
    "story": "This crunchy noodle snack was a staple in many households in Hong Kong, and it was one of my all-time favorites. Whenever I opened a pack of MAMEE Snack Noodles, the first thing I would do is crush the noodles into small pieces inside the packet. Then, I would sprinkle in the seasoning powder and shake everything up until the noodles were evenly coated.\n\nThe result was a savory, crunchy snack that was perfect for satisfying my hunger pangs. The seasoning powder had just the right amount of saltiness and spice, and the texture of the crushed noodles was addictively satisfying.\n\nI loved snacking on MAMEE Snack Noodles during my after-school activities, whether it was hanging out with friends or playing sports. The snack was easy to carry around in my backpack, and I could quickly whip up a serving whenever I needed a quick boost of energy.\n\nAs I grew older, I continued to enjoy MAMEE Snack Noodles as a comforting snack. Whenever I missed the taste of home, I would make sure to stock up on a few packets of the snack."
  },
  {
    "id": 2,
    "snackno": "SNACK 2",
    "snacknameeng": "DAHFA Fish snack",
    "snacknamechi": "大發鱈魚香絲",
    "cantonesepronunciation": "daai6 faat3 syut3 jyu2 hoeng1 si1",
    "origin": "Malaysia",
    "img": "dahfafishsnack.jpg",
    "description": "a prepared seafood snack made of seasoned and dried pollack fish. This savory and chewy snack is extremely popular in Asia. Each bite is chewy and intensely rich in umami.",
    "netweight": "8g",
    "category": "Meat-based Snack",
    "priceusd": "$0.86",
    "flavors": "Original",
    "brand": "Dahfah",
    "personalrating": "★★★",
    "story": "At first glance, the fish snack looked like a simple pack of small, crispy fish-shaped crackers. But when I took my first bite, I was pleasantly surprised by the savory and slightly spicy flavor that packed a punch. The texture was light and airy, and the seasoning had just the right amount of heat.\n\nAs someone who grew up loving seafood, the DAHFAH Fish snack quickly became one of my go-to snacks. I loved munching on them while working or watching TV, and I even started bringing them as souvenirs for my family and friends."
  },
  {
    "id": 3,
    "snackno": "SNACK 3",
    "snacknameeng": "ORION Korepab Snack",
    "snacknamechi": "奧利安魚仔餅",
    "cantonesepronunciation": "ou3 lei6 on1 jyu2 zai2 beng2",
    "origin": "Korea",
    "img": "orionkorepabsnack.jpg",
    "description": "a popular classic snack where you can enjoy both taste and fun at the same time because it contains marine life characters. Crunchy and hollow crackers with a salty roasted seasoning taste.",
    "netweight": "33g",
    "category": "Crunches",
    "priceusd": "$2.11",
    "flavors": "Roasted Chicken, Seaweed, Tomato",
    "brand": "Orion",
    "personalrating": "★★★★★",
    "story": "I was thrilled to discover the ORION Korepab Snack during my travels in Hong Kong. This unique snack resembled a small bag of bite-sized hollow crunchies in marine life characters that came in a variety of flavors, from savory to sweet.\n\nThe first flavor I tried was spicy chicken, and I was blown away by the bold and spicy taste. The texture was crispy and crunchy, and each ball was packed with flavor. I quickly became hooked and started trying all the different flavors, from sweet and sour to BBQ.\n\nWhat I loved most about the ORION Korepab Snack was how versatile it was. I would pack a bag in my backpack for a quick and convenient snack while hiking or exploring the city, and they were also perfect for movie nights at home with friends."
  },
  {
    "id": 4,
    "snackno": "SNACK 4",
    "snacknameeng": "YUPI Gummy Candy Hamburger",
    "snacknamechi": "漢堡橡皮糖",
    "cantonesepronunciation": "hon3 bou2 zoeng6 pei4 tong4",
    "origin": "Indonesian",
    "img": "yupi-gummy-hamburger.jpeg",
    "description": "Each gummy burger is individually wrapped for freshness and is made up of 5 individual gummy pieces, stacked in a tiny plastic tray to form a burger. Each color is a different fruity flavor, or you can eat them together, or one ingredient at a time.",
    "netweight": "96g",
    "category": "Gummy",
    "priceusd": "$4.35",
    "flavors": "Original",
    "brand": "Yupi",
    "personalrating": "★★★★",
    "story": "The first time I saw the YUPI Gummy Candy Hamburger in a Hong Kong convenience store, I was immediately intrigued. As a lover of both gummy candy and fast food, I couldn't resist trying this unique snack.\n\nThe packaging was designed to look like a small hamburger, complete with a sesame seed bun, lettuce, tomato, cheese, and a patty. When I opened the package, I was surprised to find that each of these burger components was actually a separate piece of gummy candy.\n\nI started by trying the lettuce, which was a bright green color and had a sweet, fruity flavor. Next, I tried the tomato, which was a chewy red candy with a slightly tangy taste. The cheese was a soft, creamy candy that melted in my mouth, and the sesame seed bun was a soft, fluffy gummy with a subtle sweetness. \n\nAs I munched on the YUPI Gummy Candy Hamburger, I couldn't help but smile at how fun and playful the snack was. It was a unique twist on the typical gummy candy, and the attention to detail in the packaging and flavors was impressive."
  },
  {
    "id": 5,
    "snackno": "SNACK 5",
    "snacknameeng": "FOUR SEAS Prawn Cracker",
    "snacknamechi": "四洲蝦餅",
    "cantonesepronunciation": "sei3 zau1 haa1 beng2",
    "origin": "Hong Kong",
    "img": "fourseas-pawn-cracker-original.jpeg, fourseas-pawn-cracker-seaweed.jpeg",
    "description": "Not your conventional prawn cracker, this is an ultra thin crispy version of the classic and makes a great alternative to crisps.",
    "netweight": "15g",
    "category": "Crackers",
    "priceusd": "$1.00",
    "flavors": "Original, Seaweed",
    "brand": "Four Seas",
    "personalrating": "★★★",
    "story": "I have always been a big fan of seafood, so when I first tasted the FOUR SEAS Prawn Cracker in Hong Kong, I was instantly hooked. The snack had a light and crispy texture, and it was bursting with flavor.\n\nThe prawn flavor was strong but not overpowering, and there was a subtle sweetness that complemented the savory taste perfectly. I loved the way the crackers practically melted in my mouth, leaving behind a rich and satisfying taste that lingered long after the last bite."
  },
  {
    "id": 6,
    "snackno": "SNACK 6",
    "snacknameeng": "JACK N JILL Potato Cracker",
    "snacknamechi": "珍珍牛仔片",
    "cantonesepronunciation": "zan1 zan1 ngau4 zai2 pin3",
    "origin": "Hong Kong",
    "img": "jacknjill-potato-cracker.jpeg",
    "description": "The classic potato cracker is crispy in the mouth, and the waffle-shaped cracker is an alternative beef-flavored potato chip shape.",
    "netweight": "38g",
    "category": "Chips",
    "priceusd": "$3.34",
    "flavors": "Beef",
    "brand": "Jack N Jill",
    "personalrating": "★★★",
    "story": "One of my favorite discoveries was the JACK N JILL Potato Cracker - a thin and crispy snack that quickly became my go-to for satisfying my cravings.\n\nThe JACK N JILL Potato Cracker was unique in that it had a light and airy texture, unlike any other potato chips I had tried before. The flavor was savory and addictive, and I found myself reaching for another cracker every time I finished one.\n\nThe JACK N JILL Potato Cracker became a staple in my diet. Whether I was studying for exams or binge-watching my favorite TV show, the snack was always by my side, providing me with the comfort and familiarity I needed to feel at home."
  },
  {
    "id": 7,
    "snackno": "SNACK 7",
    "snacknameeng": "SZE HING LOONG Cheese Ring",
    "snacknamechi": "時興隆芝士圈",
    "cantonesepronunciation": "si4 hing1 lung4 zi1 si6 hyun1",
    "origin": "Hong Kong",
    "img": "szehingloong-cheese-ring.jpeg",
    "description": "A ring-shaped snack with cheesy goodness blended so well in it that when you bite into this crunchy ring, it sends cheesy signals to your taste buds and up your brain. Cheese Ring is indeed a treat that satisfies your craving for a cheesy flavor.",
    "netweight": "60g",
    "category": "Crunches",
    "priceusd": "$3.31",
    "flavors": "Cheese",
    "brand": "Sze Hing Loong",
    "personalrating": "★★★",
    "story": "The cheese ring had a unique texture - it was light and airy, yet crispy and crunchy at the same time. And the flavor was like nothing I had tasted before. It had a strong and tangy cheese taste that was perfectly balanced with a hint of sweetness.\n\nI quickly became obsessed with the SZE HING LOONG Cheese Ring and would make sure to buy a bag every time I passed by a snack shop. It became my go-to snack during long days of exploring the city.\n\nBut what really made the SZE HING LOONG Cheese Ring special for me was the memories it created. As I walked through the busy streets of Hong Kong, munching on my cheese rings, I felt like I was truly experiencing the city - its flavors, its culture, and its energy."
  },
  {
    "id": 8,
    "snackno": "SNACK 8",
    "snacknameeng": "GINBIS Animal Shaped Biscuits",
    "snacknamechi": "愉快動物餅",
    "cantonesepronunciation": "jyu4 faai3 dung6 mat6 beng2",
    "origin": "Japan",
    "img": "ginbis-animal-shaped-biscuits.jpeg",
    "description": "These are butter, coconut, or seaweed-flavored animal biscuits. They are comically simplistic in shape but the snap and the flavor of the cookie itself more than makeup for it. They're somewhere between a butter cracker and a cookie, and they're very lightly savory and sweet.",
    "netweight": "37g",
    "category": "Biscuits",
    "priceusd": "$2.61",
    "flavors": "Seaweed, Butter, Coconut",
    "brand": "Ginbis",
    "personalrating": "★★★★★",
    "story": "The GINBIS Animal Shaped Biscuits were a staple in my childhood snack collection. These adorable little biscuits came in a variety of animal shapes - from bears to lions to elephants - and were always a hit at school snack time.\n\nI remember being mesmerized by the packaging of the GINBIS Animal Shaped Biscuits - the colorful designs and cute animal illustrations made them stand out from all the other snacks on the shelves. And the biscuits themselves were equally delightful - light and crispy, with a subtle sweetness that kept me coming back for more.\n\nBut what really made the GINBIS Animal Shaped Biscuits special for me was the childhood memories they created. Whenever I opened a pack of these biscuits, it felt like I was transported to a magical world where animals could come to life and talk to me.\n\nI would spend hours playing with the animal-shaped biscuits, giving them names and creating imaginary adventures for them. They became my loyal companions during long car rides or boring family dinners, always ready to bring a smile to my face.\n\nEven now, as an adult, I can't help but feel a sense of nostalgia whenever I come across a pack of GINBIS Animal Shaped Biscuits. They remind me of simpler times, of childhood innocence and wonder, and of the joy that a small snack can bring."
  },
  {
    "id": 9,
    "snackno": "SNACK 9",
    "snacknameeng": "CALBEE Potato Chips",
    "snacknamechi": "卡樂B 熱浪薯片",
    "cantonesepronunciation": "kaa1 lok6 B jit6 long6 syu4 pin3",
    "origin": "Hong Kong",
    "img": "calbee-potato-chips-curry.jpeg, calbee-potato-chips-hot.jpeg",
    "description": "Calbee Hot & Spicy potato chips are a must try for spicy lovers. Crispy chips that are packed with savory, spicy flavor.",
    "netweight": "55g",
    "category": "Chips",
    "priceusd": "$3.68",
    "flavors": "Hot & Spicy, Curry, BBQ, Okonomiyaki",
    "brand": "Calbee",
    "personalrating": "★★★",
    "story": "As a potato chip lover, I couldn't resist trying the CALBEE Potato Chips. And let me tell you - I was not disappointed.\n\nThe CALBEE Potato Chips had a unique texture that set them apart from other potato chips I had tried before. They were thicker and crunchier, with a satisfying snap that made them incredibly addictive. And the flavors - oh, the flavors! From classic salted to spicy curry to sweet corn - there was something for everyone.\n\nBut what really made the CALBEE Potato Chips special for me was the memories they created. I remember sitting on a park bench in Hong Kong, munching on a bag of salted CALBEE chips and watching the locals go about their day. It was a moment of peace and serenity in the midst of a bustling city, and the taste of the chips somehow made it even more special.\n\nFrom that moment on, CALBEE Potato Chips became my go-to snack whenever I needed a little pick-me-up or a taste of Hong Kong. And even after I left the city, I would search high and low for them in snack stores and international markets, always excited to see what new flavors had been released."
  },
  {
    "id": 10,
    "snackno": "SNACK 10",
    "snacknameeng": "CALBEE Vegetable Fries",
    "snacknamechi": "卡樂B什菜薯條",
    "cantonesepronunciation": "kaa1 lok6 B sam6 coi3 syu4 tiu4",
    "origin": "Japan",
    "img": "calbee-vegetable-fries.jpeg, calbee-vegetable-fries-tomato.png",
    "description": "A delicious barbecue flavoured vegetable snack carries with 6 kinds of vegetables carrot, spinach, onion, pumpkin, tomato and potato. Giving your life the enjoyment of vegetables along with its unique crunchiness and tastiness.",
    "netweight": "42g",
    "category": "Fries",
    "priceusd": "$3.68",
    "flavors": "Original, Tomato",
    "brand": "Calbee",
    "personalrating": "★★★★",
    "story": "The first time I tried CALBEE Vegetable Fries, I was a bit skeptical. I had always been a fan of traditional potato fries and was hesitant to try something made from vegetables. But as soon as I took my first bite, I was hooked.\n\nCALBEE Vegetable Fries had a unique flavor and texture that I had never experienced before in a snack. They were light and crispy, with just the right amount of seasoning to make them irresistible. And the fact that they were made from real vegetables - like carrots and green beans - made me feel like I was making a healthier snack choice.\n\n CALBEE Vegetable Fries became my go-to snack whenever I needed a quick and healthy bite. And even after I left Hong Kong, I would seek them out in snack stores and international markets, always excited to introduce my friends to this delicious and unique snack."
  },
  {
    "id": 11,
    "snackno": "SNACK 11",
    "snacknameeng": "CALBEE GRILL A CORN",
    "snacknamechi": "卡樂B粟一燒",
    "cantonesepronunciation": "kaa1 lok6 B suk1 jat1 siu1",
    "origin": "Japan",
    "img": "calbee-grill-a-corn-bbq.jpeg",
    "description": "Delicious Crispy Snacks! A great combination of honey roasted chicken and freshly grilled corn. A crunchy corn snack to have anytime during the day!.",
    "netweight": "80g",
    "category": "Crunches",
    "priceusd": "$3.68",
    "flavors": "BBQ, Honey Chicken, Kabayaki, Hot & Spicy, Lobster in Supreme Soup",
    "brand": "Calbee",
    "personalrating": "★★★",
    "story": "CALBEE Grill a Corn has been a staple snack throughout my life. I remember buying them from street vendors during school breaks or snacking on them while watching movies with my friends.\n\nThe unique flavor and texture of Grill a Corn always stood out to me. The smoky and savory taste of the kernels, combined with the crispy texture, made it a satisfying snack that I couldn't get enough of. It was the perfect snack to share with friends, and we would often pass a bag around while hanging out.\n\nOne of my fondest memories of Grill a Corn was during a family trip to Victoria Peak. My family and I took the tram up to the peak and enjoyed the breathtaking view of the city skyline. We bought a bag of Grill a Corn from a street vendor and munched on them while taking in the sights. The combination of the delicious snack and the stunning view made it a memory that I will always cherish."
  },
  {
    "id": 12,
    "snackno": "SNACK 12",
    "snacknameeng": "BRILLIANT Indonesia Shrimp Chips",
    "snacknamechi": "明輝蝦片",
    "cantonesepronunciation": "ming4 fai1 haa1 pin3",
    "origin": "Indonesia",
    "img": "brilliant-indonesia-shrimp-chips.jpeg",
    "description": "A unique crunchy snack experience that fuses the savory taste of freshly-caught shrimp with authentic and distinctive flavors.",
    "netweight": "60g",
    "category": "Chips",
    "priceusd": "$3.23",
    "flavors": "Original",
    "brand": "Brilliant",
    "personalrating": "★★★★★",
    "story": "Growing up in Hong Kong, I always had a soft spot for BRILLIANT Indonesia Shrimp Chips. Whenever I went grocery shopping with my family, I made sure to pick up a bag or two of these delicious chips. The bold and savory flavor was always a favorite of mine, and I loved the satisfying crunch that came with each bite.\n\nInterestingly enough, my dad also had a love for BRILLIANT Indonesia Shrimp Chips. Whenever he accompanied me to the store, he would always pick up a bag or two of his own. We both shared a love for the snack, and it became a bit of a tradition for us to snack on them together while watching TV or chatting at home.\n\nOver the years, BRILLIANT Indonesia Shrimp Chips became a staple in our household. It was a snack that we always had on hand, whether it was for a movie night with friends or a quick snack on the go."
  },
  {
    "id": 13,
    "snackno": "SNACK 13",
    "snacknameeng": "JACK N JILL Potato Rings",
    "snacknamechi": "珍珍薯圈",
    "cantonesepronunciation": "zan1 zan1 syu4 hyun1",
    "origin": "Hong Kong",
    "img": "jacknjill-potato-rings.jpeg",
    "description": "These cheddar cheese-flavored potato snacks are the perfect combination of crispy, crunchy and cheesy. Made with real cheese, these potato rings are packed with bold cheddar flavors that will satisfy your taste buds.",
    "netweight": "65g",
    "category": "Crunches",
    "priceusd": "$3.34",
    "flavors": "Cheese, Smoked Ham",
    "brand": "Jack N Jill",
    "personalrating": "★★★",
    "story": "I first discovered this snack when I was a teenager. I was browsing through a convenience store when I saw the bright yellow packaging of the JACK N JILL Potato Rings, and the smoked ham flavor caught my eye. Intrigued, I decided to give it a try.\n\nFrom the first bite, I was hooked. The crispy texture of the potato rings combined with the savory flavor of smoked ham was simply irresistible. I found myself buying a bag every time I passed by a convenience store or supermarket, and it quickly became my go-to snack.\n\nI loved how easy it was to carry the snack around with me, whether I was hanging out with friends or studying for exams. Whenever I needed a quick pick-me-up or a distraction from my studies, I would reach for my trusty bag of JACK N JILL Potato Rings. The snack never failed to satisfy my cravings, and I always looked forward to the next time I could indulge in it."
  },
  {
    "id": 14,
    "snackno": "SNACK 14",
    "snacknameeng": "GARDEN Chocolate Fingers",
    "snacknamechi": "嘉頓朱古力手指餅",
    "cantonesepronunciation": "gaa1 deon6 zyu1 gu2 lik6 sau2 zi2 beng2",
    "origin": "Hong Kong",
    "img": "garden-chocolate-fingers.jpeg",
    "description": "A delicious, crispy biscuit fingers with flavor that are encased in creamy chocolate",
    "netweight": "70g",
    "category": "Biscuit Sticks",
    "priceusd": "$3.96",
    "flavors": "Chocolate",
    "brand": "Garden",
    "personalrating": "★★★",
    "story": "One of my favorite snacks growing up was the GARDEN Chocolate Fingers.\n\nGARDEN was a popular brand in Hong Kong, known for its tasty snacks and affordable prices. One day, when I was about six years old, my mom brought home a bag of GARDEN Chocolate Fingers from the grocery store. I had never tried them before, but as soon as I tasted them, I was hooked.\n\nThe snack consisted of long, thin biscuit sticks coated in a generous layer of rich chocolate. The texture was crunchy and the chocolate was creamy and sweet, making for a perfect combination of flavors and textures. I remember how I would always savor each bite, trying to make the snack last as long as possible.\n\nFrom that day on, GARDEN Chocolate Fingers became a staple in our household. My siblings and I would often snack on them after school, and they became a popular choice for movie nights or long car rides. I also remember bringing them to school as a treat to share with my classmates during recess.\n\nAs I grew older, my taste in snacks diversified, and I began to explore other popular Hong Kong snacks like pineapple buns and egg tarts. However, GARDEN Chocolate Fingers remained a constant in my life, and I still enjoy them today."
  },
  {
    "id": 15,
    "snackno": "SNACK 15",
    "snacknameeng": "CORIS Whistle Candy Grape",
    "snacknamechi": "哨子糖",
    "cantonesepronunciation": "saau3 zi2 tong4",
    "origin": "Japan",
    "img": "coris_whistle_candy.jpeg",
    "description": "Without a doubt the noisiest candy ever made, the Whistle Candy was popular amongst kids. All you have to do is hold the piece of candy vertically between your lips and blow or inhale as hard as you can for a high-pitched whistle sound. The Whistle Candy usually comes with a small plastic toy too, giving you twice the fun.",
    "netweight": "22g",
    "category": "Candy",
    "priceusd": "$1.51",
    "flavors": "Grape",
    "brand": "Brand\nCoris",
    "personalrating": "★★★★",
    "story": "The CORIS Whistle Candy Grape was a grape-flavored hard candy that came in a small, colorful plastic container. The container featured a whistle on one end, which added an element of excitement and playfulness to the candy. As a child, I loved blowing the whistle and making music with my friends while enjoying the delicious grape flavor.\n\nI remember begging my mom to buy me CORIS Whistle Candy Grape whenever we went to the local convenience store. She would always indulge my sweet tooth, and I would spend hours playing with the whistle and savoring the candy.\n\nAs I grew older, I started to appreciate the nostalgia associated with the CORIS Whistle Candy Grape. Whenever I saw the candy in a store, it would bring back memories of carefree childhood days spent with friends, blowing the whistle and laughing until our bellies hurt."
  },
  {
    "id": 16,
    "snackno": "SNACK 16",
    "snacknameeng": "WANT WANT Senbei Rice Crackers",
    "snacknamechi": "旺旺仙貝",
    "cantonesepronunciation": "wong6 wong6 sin1 bui3",
    "origin": "China",
    "img": "wantwant-senbei-rice-crackers.jpeg",
    "description": "Want Want Senbei Rice Crackers are a delicious, cholesterol free, baked, rice cracker snack. Senbei rice crackers are crispy and light with a subtle combination of sweet and salty flavors. Senbei rice crackers are a type of Japanese rice cracker traditionally baked over hot coals. These flat, crunchy crackers, often soy sauce flavored, date back thousands of years and come in both sweet and savory varieties.",
    "netweight": "112g",
    "category": "Crackers",
    "priceusd": "$2.49",
    "flavors": "Original",
    "brand": "Want Want",
    "personalrating": "★★★★",
    "story": "These delicious and addictive snacks were a staple in my household, and they never failed to satisfy my craving for something savory and crispy.\n\nWANT WANT was a popular brand in Hong Kong, known for their tasty and affordable snacks. Their Senbei Rice Crackers were a particular favorite of mine, and I remember how excited I would get whenever I saw the bright blue packaging in the grocery store.\n\nThe Senbei Rice Crackers were crispy discs made from rice flour, soy sauce, and other savory seasonings. They were lightly salted and had a satisfying crunch that made them perfect for snacking. I would often munch on them while watching TV or doing homework, and I loved how they always left my fingers slightly greasy and salty."
  },
  {
    "id": 17,
    "snackno": "SNACK 17",
    "snacknameeng": "Ice Gem Biscuits",
    "snacknamechi": "蛋白花占餅",
    "cantonesepronunciation": "daan2 baak6 faa1 zim3 beng2",
    "origin": "Hong Kong",
    "img": "ice_gem_cookies.jpeg",
    "description": "More commonly known as 'Belly Button Biscuits', each of these round little biccies are topped with bright, colourful icing. It's one of those snacks that everyone had a pack of at home, and everyone had their own way of eating them.",
    "netweight": "150g",
    "category": "Biscuits",
    "priceusd": "$6.99",
    "flavors": "Original",
    "brand": "N/A",
    "personalrating": "★★★",
    "story": "Ice Gem Biscuits are colorful and sweet treats were a staple in my childhood, and they never failed to put a smile on my face. They were a type of sweet biscuit that featured a colorful, sugar-coated top. The tops were covered in small, colorful candy beads that added a satisfying crunch and sweetness to the biscuit.\n\nAs a child, Ice Gem Biscuits were a popular snack for birthday parties and school events. I would always look forward to these occasions, knowing that there would be a plate of colorful Ice Gem Biscuits waiting for me. They were also a popular choice for road trips and picnics, as they were easy to pack and transport.\n\nWhat I loved most about Ice Gem Biscuits was how they made me feel. The bright colors and sweet flavors always brought a sense of joy and happiness, and they were the perfect pick-me-up on a bad day. They were also a reminder of the carefree and fun-loving nature of childhood, and I treasured every moment I spent enjoying them."
  },
  {
    "id": 18,
    "snackno": "SNACK 18",
    "snacknameeng": "Haw flakes",
    "snacknamechi": "山楂餅",
    "cantonesepronunciation": "saan1 caa4 beng2",
    "origin": "China",
    "img": "haw-flakes.jpeg",
    "description": "These small pink discs are made from hawthorn fruit, which is traditionally used as a digestive aid in Chinese medicine. Haw flakes are tangy and sweet and fun to eat. Just unwrap the packaging, peel a few disks off, and pop into your mouth!",
    "netweight": "90g",
    "category": "Flakes",
    "priceusd": "$1.29",
    "flavors": "Original",
    "brand": "3 Flowers",
    "personalrating": "★★★★",
    "story": "Haw flakes are sweet and tangy treats were a staple in my childhood, and they hold a special place in my heart as a quintessential Hong Kong snack. They were a type of candy that originated from China, but they quickly became a popular snack in Hong Kong. They were made from the fruit of the Chinese hawthorn tree and had a distinctive sweet and tangy flavor that was hard to resist. The candy was compressed into small, reddish-brown discs that were packaged in a small rectangular box with a picture of the hawthorn fruit on the front.\n\nI remember how much I loved the taste of Haw flakes as a child. The unique flavor was unlike anything else I had ever tasted, and I would often eat them by the handful. They were a popular snack at school, and I would often trade them with my classmates for other treats."
  },
  {
    "id": 19,
    "snackno": "SNACK 19",
    "snacknameeng": "FOUR SEAS Toasted Seaweed",
    "snacknamechi": "四洲紫菜",
    "cantonesepronunciation": "sei3 zau1 zi2 coi3",
    "origin": "Hong Kong",
    "img": "fourseas-toasted-seaweed-wasabi.jpeg, fourseas-toasted-seaweed-original.jpeg, fourseas-toasted-seaweed-tomato.jpeg",
    "description": "",
    "netweight": "37.5G",
    "category": "Seaweed",
    "priceusd": "$8.75",
    "flavors": "Original, Wasabi, Tomato",
    "brand": "Four Seas",
    "personalrating": "★★★",
    "story": "Four Seas Toasted Seaweed was a snack that featured sheets of crispy, toasted seaweed that had been lightly seasoned with salt and other spices. The seaweed was cut into bite-sized pieces that were perfect for snacking, and the flavor was a perfect combination of salty and umami.\n\nI remember how much I loved the taste of Four Seas Toasted Seaweed as a child. It was the perfect snack to have while watching TV or playing video games, and I would often eat an entire package in one sitting. It was also a popular snack to bring to school or share with friends, and it quickly became a favorite among my classmates.\n\nWhat I loved most about Four Seas Toasted Seaweed was how it represented the unique flavors and ingredients that were a part of Hong Kong's culinary culture. Seaweed was not a typical snack ingredient in other parts of the world, but in Hong Kong, it was a beloved and essential ingredient that added a distinct flavor and texture to many dishes."
  },
  {
    "id": 20,
    "snackno": "SNACK 20",
    "snacknameeng": "LOTTE Koala’s March",
    "snacknamechi": "樂天熊仔餅",
    "cantonesepronunciation": "lok6 tin1 hung4 zai2 beng2",
    "origin": "Japan",
    "img": "lotte-koalas-march.png",
    "description": "One of the most signature Hong Kong snacks has to be Koala’s March (even though it’s originally from Japan). Filled with smooth chocolate on the inside, Koala’s March is undoubtedly local kids’ favorite kind of biscuit. Offering a range of core flavors like strawberry chocolate and double chocolate.",
    "netweight": "50g",
    "category": "Biscuits",
    "priceusd": "$3.50",
    "flavors": "Chocolate, Strawberry",
    "brand": "Lotte",
    "personalrating": "★★★★",
    "story": "Lotte Koala's March biscuits were a snack that featured small, bite-sized biscuits that were shaped like koala bears. Each biscuit was filled with a creamy, chocolate or strawberry filling that was the perfect combination of sweet and indulgent. The biscuits were packaged in a colorful box that featured cartoon images of koalas engaging in various activities.\n\nI remember how much I loved the taste of Lotte Koala's March biscuits as a child. They were the perfect snack to have after school or during a break from homework, and I would often share them with my siblings or friends. \n\nWhat I loved most about Lotte Koala's March biscuits was how they represented the fun and playful side of Hong Kong's snack culture. The colorful packaging and cute koala bear shapes made them appealing to children and adults alike, and they were a beloved and iconic snack in Hong Kong's culinary scene."
  },
  {
    "id": 21,
    "snackno": "SNACK 21",
    "snacknameeng": "FRUTIPS Pastilles",
    "snacknamechi": "能得利軟糖",
    "cantonesepronunciation": "nang4 dak1 lei6 jyun5 tong4",
    "origin": "Hong Kong",
    "img": "fruitips-pastilles-black-current.jpeg, frutips-pastilles-mixedfruits.jpeg",
    "description": "FRUTIPS Juice Marshmallows and Juices Gummy, a collection of black currants, limes, lemons, oranges, green apples, apples, pineapples and strawberries. To feel real fruit juice!",
    "netweight": "50g",
    "category": "Gummy",
    "priceusd": "$2.74",
    "flavors": "Black Current, Mixed Fruits",
    "brand": "Frutips",
    "personalrating": "★★★★★",
    "story": "I remember my mom would always have a few packs of FRUTIPS in her purse or in the kitchen pantry. Whenever I was feeling a little peckish, I would grab a handful of these pastilles and pop them in my mouth. The burst of flavor was always so satisfying, and the chewy texture made them a fun treat to munch on.\n\nFRUTIPS came in a variety of flavors, from the classic strawberry and orange to more exotic options like lychee and passion fruit. I loved trying all the different flavors and seeing which ones were my favorites. I remember always feeling a sense of excitement whenever my mom would come home with a new flavor of FRUTIPS for us to try.\n\nAs I got older and started going to school, FRUTIPS became a popular snack among my classmates too. It was a common sight to see kids trading FRUTIPS with each other during recess or lunchtime. Sometimes we would even have contests to see who could fit the most FRUTIPS in their mouth at once (although I don't recommend trying this at home!)."
  },
  {
    "id": 22,
    "snackno": "SNACK 22",
    "snacknameeng": "TAIYO Mama Fish Sausage",
    "snacknamechi": "大洋媽媽魚肉腸",
    "cantonesepronunciation": "daai6 joeng4 maa1 maa1 jyu4 juk6 coeng4",
    "origin": "Japan",
    "img": "taiyo-fish-sausage.jpeg",
    "description": "A nostalgic ready-to-eat fish sausage snack that you will no matter if you are a fish lover or not. Just twist it in the middle and pop it out to eat it.",
    "netweight": "22g",
    "category": "Meat-based Snack",
    "priceusd": "$1.36",
    "flavors": "Original",
    "brand": "Taiyo",
    "personalrating": "★★★",
    "story": "One of the things that made TAIYO Mama Fish Sausage so unique was the way we would eat it. While some people used scissors to cut off the tip and eat it like a regular sausage, my friends and I had a different approach. We would twist the sausage open in the middle and squeeze it out, almost like a tube of toothpaste. It might have looked strange to some, but we firmly believed that this was the correct way to eat it.\n\nThe texture was soft and chewy, with a slightly salty and savory taste. We would often compete to see who could twist open the most sausages in the shortest amount of time, or who could squeeze out the longest piece of filling."
  },
  {
    "id": 23,
    "snackno": "SNACK 23",
    "snacknameeng": "STRIKING Popping Candy",
    "snacknamechi": "爆炸糖",
    "cantonesepronunciation": "baau3 zaa3 tong4",
    "origin": "Hong Kong",
    "img": "striking-popping-candy.jpeg",
    "description": "Bring back to childhood with Striking Popping Candy! enjoy the amazing taste and tons of surprises that pop in your mouth. It can be used in many desserts to give the surprise element as well. There are 20 individually pouches wrapped in the pack that are best for sharing with your friends any time, anywhere.",
    "netweight": "30g",
    "category": "Candy",
    "priceusd": "$2.29",
    "flavors": "Lychee, Green Apple, Peach, Watermelon",
    "brand": "Striking",
    "personalrating": "★★★",
    "story": "STRIKING Popping Candy was unique because of the way it popped and crackled in your mouth. It was a sensation unlike any other candy I had tried before. I remember the excitement of opening a packet of STRIKING Popping Candy and pouring it into my mouth, feeling the candy fizz and pop against my tongue.\n\nMy friends and I would often compete to see who could keep the candy popping in their mouth the longest without swallowing. We would laugh and giggle as the candy fizzed and crackled, sometimes making funny noises that would make us all burst into fits of laughter.\n\nI also remember the packaging of STRIKING Popping Candy, which featured a cartoon character with a big smile and a lightning bolt on his head. The bright colors and fun design added to the excitement of eating the candy."
  },
  {
    "id": 24,
    "snackno": "SNACK 24",
    "snacknameeng": "GARDEN Cream Wafers",
    "snacknamechi": "嘉頓忌廉威化",
    "cantonesepronunciation": "gaa1 deon6 gei6 lim4 wai1 faa3",
    "origin": "Hong Kong",
    "img": "garden-cream-wafers-choco.jpeg",
    "description": "Wafers are the best snack to go during snack time. Garden cream wafers are a crispy wafers with tasty filling between each layer. The amount of crispiness is made to perfection.",
    "netweight": "200g",
    "category": "Wafer",
    "priceusd": "$2.69",
    "flavors": "Chocolate, Cappuccino, Strawberry, Lemon, Coconut, Durian, Peanut, Vanilla, Peach",
    "brand": "Garden",
    "personalrating": "★★★",
    "story": "I remember the first time my parents bought a box of Garden Cream Wafers for my brother and I to try. The packaging was simple, yet eye-catching, with a glossy packaging and bright colors that featured images of the wafers themselves. As soon as I opened the box, I was hit with the sweet smell of the creamy filling that was sandwiched between two crispy wafers.\n\nI took a bite and was instantly hooked. The wafers were light and airy, with just the right amount of sweetness. The cream filling was smooth and velvety, and had a rich vanilla flavor that was irresistible. I quickly devoured my first wafer, and begged my parents for another one."
  },
  {
    "id": 25,
    "snackno": "SNACK 25",
    "snacknameeng": "FOUR SEAS Biscuit Sticks",
    "snacknamechi": "四洲甘大滋餅乾條",
    "cantonesepronunciation": "sei3 zau1 gam1 daai6 zi1 beng2 gon1 tiu4",
    "origin": "Hong Kong",
    "img": "fourseas-biscuit-sticks.jpeg",
    "description": "One of the 90s kids' favorites. Four Seas biscuit sticks might look plain on the outside, but they’re the ultimate savory munchies to satisfy your cravings.",
    "netweight": "40g",
    "category": "Biscuit Sticks",
    "priceusd": "$1.95",
    "flavors": "Original, Tomato",
    "brand": "Four Seas",
    "personalrating": "★★★",
    "story": "FOUR SEAS Biscuit Sticks were a simple yet satisfying snack. They had a light, crispy texture and a slightly sweet taste. I loved the feeling of biting into them and feeling them crunch between my teeth.\n\nOne of my favorite ways to eat FOUR SEAS Biscuit Sticks was to dip them into a cup of hot chocolate or milk. The biscuits would absorb the liquid and become slightly softened, making them even more enjoyable to eat. I would often take my time savoring each bite, enjoying the contrast between the crunchy biscuit and the creamy liquid.\n\nI also remember the packaging of FOUR SEAS Biscuit Sticks, which featured a cartoon character holding a giant biscuit stick. The bright colors and fun design added to the appeal of the snack."
  },
  {
    "id": 26,
    "snackno": "SNACK 26",
    "snacknameeng": "WANT WANT Crunchy Chocolate Roll",
    "snacknamechi": "旺旺黑白配",
    "cantonesepronunciation": "wong6 wong6 hak1 baak6 pui3",
    "origin": "China",
    "img": "wantwant-crunchy-wafer-roll.jpeg",
    "description": "A crunchy chocolate wafer roll filled with vanilla cream inside.",
    "netweight": "60g",
    "category": "Wafer",
    "priceusd": "$3.96",
    "flavors": "Original",
    "brand": "Want Want",
    "personalrating": "★★★★",
    "story": "There's something about the combination of the crispy biscuit shell and the smooth, creamy chocolate filling that just hits the spot. I love the way the biscuit crackles and crunches as I bite into it, and the way the chocolate melts in my mouth.\n\nOne of my favorite memories involving WANT WANT Crunchy Chocolate Roll was during a school field trip. We had been hiking all day and were exhausted, but when we stopped for a break, I pulled out a packet of snacks from my bag. My classmates eagerly gathered around me, and soon we were all sharing the contents of the packet.\n\nWANT WANT Crunchy Chocolate Roll continues to hold a special place in my heart (and my stomach). Whenever I'm feeling stressed or homesick, a packet of these snacks always manages to lift my mood and bring back memories of my childhood in Hong Kong."
  },
  {
    "id": 27,
    "snackno": "SNACK 27",
    "snacknameeng": "OYATSU Babystar Snack Noodle",
    "snacknamechi": "明星麵童星點心麵",
    "cantonesepronunciation": "ming4 sing1 min6 tung4 sing1 dim2 sam1 min6",
    "origin": "Japan",
    "img": "otatsu-babystar-snack-noodle.jpeg, otatsu-babystar-snack-noodle-chicken.jpeg",
    "description": "aby Star Ramen is a crispy deep-fried noodle snack. With the perfect balance of chicken flavor and being toasted to perfection, this crunchy bite sized ramen is going to be your new found addiction! a pack of crispy ramen noodles that is your perfect grab-and-go snack. Experience the sweet and savory taste of the classic Japanese stir-fry ramen with every bite.",
    "netweight": "41g",
    "category": "Noodle Snack",
    "priceusd": "$2.50",
    "flavors": "Yakisoba, Chicken",
    "brand": "Oyatsu",
    "personalrating": "★★★★★",
    "story": "The clubhouse was a popular hangout spot for kids in my neighborhood. It had a swimming pool, a playground, and a games room. But for me, the highlight was always the vending machine that sold OYATSU Babystar Snack Noodle. I would save up my pocket money and rush to the machine, eagerly inserting my coins and eagerly waiting for the snack to drop down the chute.\n\nThe first bite of the snack was always the best. The crispy noodles had a satisfying crunch, and the seasoning was just the right amount of salty and savory. I would often share my snack with my friends, and we would sit together, munching on the noodles and chatting about our day.\n\nAs I grew older, my tastes in snacks changed, and I started to explore different types of snacks from all around the world. But even now, whenever I come across a bag of OYATSU Babystar Snack Noodle, I am transported back to my childhood in Hong Kong. I can still taste the crispy noodles and feel the excitement of rushing to the vending machine in my clubhouse."
  },
  {
    "id": 28,
    "snackno": "SNACK 28",
    "snacknameeng": "Ring Pop",
    "snacknamechi": "戒指糖",
    "cantonesepronunciation": "gaai3 zi2 tong4",
    "origin": "America",
    "img": "ring_pop.jpeg, ring_pop2.jpg",
    "description": "the ultimate iconic wearable lollipop with an enormous eye-catching candy gem that tastes as good as it looks. Slip it on your finger and enjoy the flavor--and the attention! Pick one delicious individually-wrapped Ring Pop lollipop from a selection of 6 mouth-watering fruity flavors",
    "netweight": "210g, 14g each",
    "category": "Candy",
    "priceusd": "$14.99",
    "flavors": "Strawberry, Blue Raspberry, Blue Raspberry Watermelon, Sour Cherry, Watermelon and Berry Blast.",
    "brand": "Ring Pop",
    "personalrating": "★★★",
    "story": "I remember the first time I tried a Ring Pop. When I was young, my mom had brought me to the local convenience store. I was browsing through the candy section, and my eyes landed on a bright, colorful display of Ring Pops. I was immediately drawn to them and begged my mom to buy me one.\n\nShe reluctantly agreed, and I eagerly tore open the packaging to reveal the candy ring. The Ring Pop was a plastic ring with a large, translucent gem on top, which was actually a hard candy that you could suck on. The candy came in a variety of flavors, including strawberry, blue raspberry, and watermelon.\n\nI was completely captivated by the Ring Pop. I loved how I could wear it on my finger like a piece of jewelry and how it slowly dissolved in my mouth, leaving behind a sweet and fruity taste. It quickly became my favorite snack, and I would ask my mom to buy me one every time we went to the store."
  },
  {
    "id": 29,
    "snackno": "SNACK 29",
    "snacknameeng": "WHITE RABBIT milk candy",
    "snacknamechi": "大白兔奶糖",
    "cantonesepronunciation": "daai6 baak6 tou3 naai5 tong4",
    "origin": "China",
    "img": "white_rabbit_milk_candy1.png, white_rabbit_milk_candy2.png",
    "description": "White Rabbit Creamy Candy is a popular Asian treat! It is has a smooth, creamy, milk flavor and is chewy like taffy. This candy is especially unique because of the thin, edible, rice paper layer that each candy is wrapped in.",
    "netweight": "180g",
    "category": "Candy",
    "priceusd": "$5.28",
    "flavors": "Milk",
    "brand": "White rabbit",
    "personalrating": "★★★",
    "story": "The candy was unique in its taste and texture. It was chewy, milky, and had a subtle sweetness that made it irresistible. The candy was wrapped in a white paper with a little cartoon rabbit on it, which added to its charm.\n\nOne of my fondest memories of eating the White Rabbit milk candy was during Chinese New Year. My family and I would sit together, eat snacks, and watch the parade on TV. We would always have a bowl of White Rabbit candy nearby, and we would pass it around, each taking a few pieces at a time.\n\nAs I grew older, I learned that the White Rabbit milk candy was not just a popular snack in Hong Kong, but also in other parts of Asia. It was a cultural icon, representing the simplicity and joy of childhood memories. I realized that I wasn't the only one who had fond memories of this candy, and that it had a special place in the hearts of many people."
  },
  {
    "id": 30,
    "snackno": "SNACK 30",
    "snacknameeng": "Bee Honey Lemon Tea Candy",
    "snacknamechi": "蜜蜂糖",
    "cantonesepronunciation": "mat6 fung1 tong4",
    "origin": "Hong Kong",
    "img": "honey_lemon_tea_candy.png",
    "description": "A hard candy with a deliciously sweet honey pleasure with a fresh lemon and tea note.",
    "netweight": "200g",
    "category": "Candy",
    "priceusd": "$6.81",
    "flavors": "Original",
    "brand": "Fruit Organic",
    "personalrating": "★★★★",
    "story": "My love for Bee Honey Lemon Tea Candy began when I was a child. I remember my mother would often bring home a bag of candies as a special treat for my siblings and me. The bright yellow packaging with a picture of a bee holding a lemon made the candy look especially appealing to us. As soon as the bag was opened, the sweet and tangy aroma of the candy would fill the room, and we would eagerly reach for a piece.\n\nI loved the way that the candy melted in my mouth, releasing a burst of honey and lemon flavor that was simultaneously refreshing and comforting. Whenever I had a sore throat or a cough, my mother would give me Bee Honey Lemon Tea Candy to soothe my throat and ease my symptoms. It became a staple in my life, a reminder of the comfort of home and the deliciousness of Hong Kong snacks."
  }
]